"use strict";

// Задание 1.
let celsius = +prompt("Введите температуру в градусах по Цельсию");
let fahrenheit = (9 / 5) * celsius + 32;
alert("Температура в градусах по Фаренгейту: " + fahrenheit);

// Задание 2.
let admin = null;
let name = "Василий";
admin = name;
console.log(admin);

// Задание 3.
/*
10 + 10 + "10"
1. К 10 прибавляем 10 - получаем 20
2. К 20 прибавляем "10" - получаем "2010"
*/
let res1 = 10 + 10 + "10";
console.log(res1);
/*
10 + "10" + 10
1. К 10 прибавляем "10" - получаем "1010"
2. К "1010" прибавляем 10 - получаем "101010"
*/
let res2 = 10 + "10" + 10;
console.log(res2);
/*
10 + 10 + +"10"
1. К 10 прибавляем 10 - получаем 20
2. Превращаем +"10" в 10
3. К 20 прибавляем 10 - получаем 30
*/
let res3 = 10 + 10 + +"10";
console.log(res3);
/*
10 / -""
1. Превращаем -"" в -0
2. Делим 10 на -0 - получаем минус бесконечность
*/
let res4 = 10 / -"";
console.log(res4);
/*
10 / +"2,5"
1. Превращаем +"2,5" в NaN
2. Делим 10 на NaN - получаем NaN
*/
let res5 = 10 / +"2,5";
console.log(res5);